<?php

//$movies = [
//    'Комедии' => [
//        "Побег из Шоушенка",
//        "Крестный отец",
//        "Тёмный рыцарь",
//        "Форрест Гамп",
//        "Начало",
//        "Матрица",
//        "Бойцовский клуб",
//        "Властелин колец: Возвращение короля",
//        "Интерстеллар",
//        [
//            'Мальчишник в Векасе',
//            "Гладиатор",
//            "Пираты Карибского моря",
//            "Джентльмены",
//            "Остров проклятых",
//            "Паразиты",
//            "Молчание ягнят",
//            "Титаник",
//        ]
//    ],
//    'Ужасы' => [
//        123,
//        "Гладиатор",
//        "Пираты Карибского моря",
//        "Джентльмены",
//        "Остров проклятых",
//        "Паразиты",
//        "Молчание ягнят",
//        "Титаник",
//        "Аватар",
//        "Дюна",
//        "Зелёная миля",
//        "Мстители: Финал",
//        'Один дома',
//        [
//            'Мальчишник в Векасе',
//            "Гладиатор",
//            "Пираты Карибского моря",
//            "Джентльмены",
//            "Остров проклятых",
//            "Паразиты",
//            "Молчание ягнят",
//            "Титаник",
//        ]
//    ]
//];

//foreach ($movies['Ужасы'] as $movieData) {
//    if (is_string($movieData) || is_int($movieData)) {
//        echo $movieData . PHP_EOL;
//    }
//
//    if (is_array($movieData)) {
//        foreach ($movieData as $movie) {
//            echo $movie . PHP_EOL;
//        }
//    }
//}


//$arrayRandomInteger = [
//    [
//        rand(1, 100), // 1
//        rand(1, 100), // 5
//        rand(1, 100), // 6
//    ],
//    [
//        rand(1, 100), // 2
//        rand(1, 100), // 5
//        rand(1, 100), // 2
//    ],
//    [
//        rand(1, 100), // 1
//        rand(1, 100), // 8
//        rand(1, 100), // 4
//    ]
//];
//
//$result = 101;
//foreach ($arrayRandomInteger as $array) {
//    if ($result > min($array)) {
//        $result = min($array);
//    }
//
//    print_r($array);
//}
//
//echo $result;


//$array1 = [1, 2, 3];
//$array2 = [4, 5, 6];
//$array3 = [];
//
//foreach ($array1 as $key => $value) {
//    $array3[] = $value;
//    unset($array1[$key]);
//}
//
//foreach ($array2 as $key => $value) {
//    $array1[] = $value;
//    unset($array2[$key]);
//}
//
//foreach ($array3 as $key => $value) {
//    $array2[] = $value;
//    unset($array3[$key]);
//}
//
//print_r($array1);
//print_r($array2);
//print_r($array3);

// array_keys , array_last , array_key_exists (для каждой функции сделать по 2 примера) что бы могли рассказать